---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.NElementsWrongPosition
source: html/f7f24d9b-d1c1-2bb0-487a-a79dc79c0671.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.NElementsWrongPosition Property

Review [Number] elements for correct position and shape

## Syntax (C#)
```csharp
public static FailureDefinitionId NElementsWrongPosition { get; }
```